insert into zhengh_major18 values
(
 '01','软件工程','01'
 ),
('02','计算机科学与技术','01'),
('03','工商管理','02')
insert into zhengh_course18 values
('01','数据库','上',32,2,'考查'),
('02','Linux','下',16,1,'考核'),
('03','JAVA','上',64,4,'考查')
insert into zhengh_teacher18 values
('01','甲老师','男',28,'副教授','18202302312','01'),('02','乙老师','女',32,'教授','18202302313','02')
insert into zhengh_adclass18 values ('01','软件工程1902','01'),('02','计算机科学与技术1902','02'),('03','工商管理1902','03')
insert into zhengh_student18 values ('01','路人甲','男',22,'大二','310000',24,'01'),('02','妹妹','女',18,'大二','200000',32,'01'),
                                    ('03','路人丙','男',21,'大二','310000',22,'02'),('04','漂亮妹妹','女',19,'大二','200000',32,'02'),
                                    ('05','可爱妹妹','女',18,'大二','310000',48,'03')
insert into zhengh_teachingclass18 values
('01','01'),
('02','01'),
('03','02'),('02','02')
insert into zhengh_studentscore18 values ('01','01',99),
('02','01',94),('03','01',48),('01','02',65),('02','02',43),('03','02',76),
('01','03',76),('02','03',87),('03','93',94)
,('01','04',42),('02','04',65),('03','04',76),
('01','05',87),('02','05',99),('03','05',90)